diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <comment>Дипломная работа Володин А.А.</comment>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если ЭтоАдресВременногоХранилища(Параметры.ДанныеДиаграммы) Тогда
        
        ДанныеДиаграммы = ПолучитьИзВременногоХранилища(Параметры.ДанныеДиаграммы); 
        
        ДиаграммаГанта.Обновление = Ложь;
        
        ДиаграммаГанта.Очистить();
        
        Для Каждого Сотрудник Из ДанныеДиаграммы Цикл
        
            ТекущаяСерия = ДиаграммаГанта.УстановитьСерию("Ежегодный отпуск");
            
            ТекущаяТочка = ДиаграммаГанта.УстановитьТочку(Сотрудник.Сотрудник);
            
            ТекущееЗначение = ДиаграммаГанта.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
                        
            ТекущийИнтервал = ТекущееЗначение.Добавить();
            ТекущийИнтервал.Начало = Сотрудник.ДатаНачала;
            ТекущийИнтервал.Конец = Сотрудник.ДатаОкончания;
                         
        КонецЦикла;
        
        ДиаграммаГанта.Обновление = Истина;
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
